### Pandas Mini Project

* Create a Pandas Series from seeing the Python Score column.

* Display the mean Python score using the Series.

* Load the project_scores.csv file into a DataFrame.

* Show only the first 3 rows of the DataFrame.

* Show only the Name and ML_Score columns.

* Add a new column called Total Score which is the sum of Python, ML, and Al scores for each student.

* Replace all missing (NaN) scores with 0.

* Add a column Result with value:

    * "Pass if Total_5core 2 2408

    * "Fail otherwise

* Display only students from the CS department who passed.

* Sort the DataFrame by Total_Score in descending order.

* Save the final cleaned DataFrame to a new file called final_results.csv

In [7]:
import pandas as pd

#Create a Pandas Series from seeing the Python Score column.

df = pd.read_csv('project_scores.csv')
python_scores = df['Python_Score']

print(python_scores)

0    85.0
1    78.0
2    92.0
3     NaN
4    69.0
Name: Python_Score, dtype: float64

In [11]:
# Display the mean Python score using the Series.

python_score_mean = python_scores.mean()

print(f"Python Score Mean : {python_score_mean}")

Python Score Mean : 81.0

In [18]:
# Load the project_scores.csv file into a DataFrame.

df = pd.read_csv('project_scores.csv')
df

    ID    Name Department  Age  Python_Score  ML_Score  AI_Score
0  101  Ayesha         CS   21          85.0      90.0       NaN
1  102     Ali         IT   22          78.0       NaN      88.0
2  103    Sara         CS   20          92.0      95.0      94.0
3  104    John         SE   23           NaN      88.0      84.0
4  105    Omer         CS   24          69.0      75.0      72.0

In [19]:
# Show only the first 3 rows of the DataFrame.

df.head(3)

    ID    Name Department  Age  Python_Score  ML_Score  AI_Score
0  101  Ayesha         CS   21          85.0      90.0       NaN
1  102     Ali         IT   22          78.0       NaN      88.0
2  103    Sara         CS   20          92.0      95.0      94.0

In [22]:
# Show only the Name and ML_Score columns.

selected_columns = df[['Name', 'ML_Score']]
print(selected_columns)

     Name  ML_Score
0  Ayesha      90.0
1     Ali       NaN
2    Sara      95.0
3    John      88.0
4    Omer      75.0

In [23]:
#Add a new column called Total Score which is the sum of Python, ML, and Al scores for each student.

df['Total_Score'] = df['Python_Score'] + df['ML_Score'] + df['AI_Score']
print(df.head())

    ID    Name Department  Age  Python_Score  ML_Score  AI_Score  Total_Score
0  101  Ayesha         CS   21          85.0      90.0       NaN          NaN
1  102     Ali         IT   22          78.0       NaN      88.0          NaN
2  103    Sara         CS   20          92.0      95.0      94.0        281.0
3  104    John         SE   23           NaN      88.0      84.0          NaN
4  105    Omer         CS   24          69.0      75.0      72.0        216.0

In [24]:
# Replace all missing (NaN) scores with 0.

df.fillna(0, inplace=True)
print(df)

    ID    Name Department  Age  Python_Score  ML_Score  AI_Score  Total_Score
0  101  Ayesha         CS   21          85.0      90.0       0.0          0.0
1  102     Ali         IT   22          78.0       0.0      88.0          0.0
2  103    Sara         CS   20          92.0      95.0      94.0        281.0
3  104    John         SE   23           0.0      88.0      84.0          0.0
4  105    Omer         CS   24          69.0      75.0      72.0        216.0

In [30]:
# Add a column Result with value: "Pass if Total_Score >= 2408 "Fail otherwise
import numpy as np

df['Result'] = np.where(df['Total_Score'] >= 240, 'Pass', 'Fail')
df.head()

,ID,Name,Department,Age,Python_Score,ML_Score,AI_Score,Total_Score,Result
0,101,Ayesha,CS,21,85.0,90.0,0.0,0.0,Fail
1,102,Ali,IT,22,78.0,0.0,88.0,0.0,Fail
2,103,Sara,CS,20,92.0,95.0,94.0,281.0,Pass
3,104,John,SE,23,0.0,88.0,84.0,0.0,Fail
4,105,Omer,CS,24,69.0,75.0,72.0,216.0,Fail

In [41]:
# Display only students from the CS department who passed.

cs_dept_passed_std = df[(df['Department']=='CS') & (df['Result']=='Pass')]
cs_dept_passed_std

,ID,Name,Department,Age,Python_Score,ML_Score,AI_Score,Total_Score,Result
2,103,Sara,CS,20,92.0,95.0,94.0,281.0,Pass

In [42]:
# Sort the DataFrame by Total_Score in descending order.

sorted_df = df.sort_values(by='Total_Score', ascending=False)
print(sorted_df)

    ID    Name Department  Age  Python_Score  ML_Score  AI_Score  Total_Score  \
2  103    Sara         CS   20          92.0      95.0      94.0        281.0
4  105    Omer         CS   24          69.0      75.0      72.0        216.0
0  101  Ayesha         CS   21          85.0      90.0       0.0          0.0
1  102     Ali         IT   22          78.0       0.0      88.0          0.0
3  104    John         SE   23           0.0      88.0      84.0          0.0

  Result
2   Pass
4   Fail
0   Fail
1   Fail
3   Fail

In [43]:
# Save the final cleaned DataFrame to a new file called final_results.csv

df.to_csv('final_results.csv', index=False)